<h1 style="font-size: 30px; text-align: center">Langage SQL - Activité d'introduction</h1>

---

Dans cette activité, vous allez découvrir comment effectuer des requêtes sur une table d'une base de données, en utilisant le langage SQL (pour *Structured Query Language*). 

Pour cela, nous allons travailler avec une table déjà étudiée l'année dernière en classe de Première, ce sera l'occasion de faire le lien avec ce qui a été vu l'an dernier.

Voici un extrait de la table utilisée l'année dernière :

| **prénom** | **jour** | **mois** | **année** | **sexe** | **projet** |
| --- | --- | --- | --- | --- | --- |
| Fathi | 3 | 2 | 2003 | G | être heureux |
| Evan | 19 | 8 | 2004 | G | manger une glace |
| Aline |29 | 10 | 2004 |F | gagner au loto |
| Baptiste | 6 | 12 | 2002 | G | devenir quelqu’un de célèbre|
| Corentin | 8 | 4 | 2004 | G | avoir une bonne note au prochain devoir |
| Estelle | 29 | 3 | 2004 | F | devenir astronaute |
| Elisa | 7 | 1 | 2004 | F | marcher sur la lune |
| Yanis | 17 | 11 | 2004 | G | dormir plus longtemps le matin |
| Leonie | 28 | 10 | 2004 | F | aider les autres |
| Lilian | 26 | 10 | 2004 | G | apprendre à piloter une Formule 1 |
| ... | ... | ... | ... | ... | ... |

Cette dernière était stockée dans un fichier `eleves.csv` que l'on pouvait importer en Python pour mémoriser son contenu dans un tableau de dictionnaires `eleves` :

In [1]:
import csv
fichier = open('eleves.csv', 'r', encoding = 'UTF-8')  # ouverture du fichier
# Lecture de son contenu avec la méthode DictReader qui renvoie une valeur spéciale représentant le fichier CSV
table = csv.DictReader(fichier, delimiter=',')  # caractère de séparation : la virgule
eleves = [dict(ligne) for ligne in table]  # chaque élément est un dictionnaire
fichier.close()  # fermeture du fichier
print(eleves) # pour afficher le contenu du tableau 'eleves'

[{'prenom': 'Fathi', 'jour': '3', 'mois': '2', 'annee': '2003', 'sexe': 'G', 'projet': 'être heureux'}, {'prenom': 'Evan', 'jour': '19', 'mois': '8', 'annee': '2004', 'sexe': 'G', 'projet': 'manger une glace'}, {'prenom': 'Aline', 'jour': '29', 'mois': '10', 'annee': '2004', 'sexe': 'F', 'projet': 'gagner au loto'}, {'prenom': 'Baptiste', 'jour': '6', 'mois': '12', 'annee': '2002', 'sexe': 'G', 'projet': 'devenir quelqu’un de célèbre'}, {'prenom': 'Corentin', 'jour': '8', 'mois': '4', 'annee': '2004', 'sexe': 'G', 'projet': 'avoir une bonne note au prochain devoir'}, {'prenom': 'Estelle', 'jour': '29', 'mois': '3', 'annee': '2004', 'sexe': 'F', 'projet': 'devenir astronaute'}, {'prenom': 'Elisa', 'jour': '7', 'mois': '1', 'annee': '2004', 'sexe': 'F', 'projet': 'marcher sur la lune'}, {'prenom': 'Yanis', 'jour': '17', 'mois': '11', 'annee': '2004', 'sexe': 'G', 'projet': 'dormir plus longtemps le matin'}, {'prenom': 'Leonie', 'jour': '28', 'mois': '10', 'annee': '2004', 'sexe': 'F', 'projet': 'aider les autres'}, {'prenom': 'Lilian', 'jour': '26', 'mois': '10', 'annee': '2004', 'sexe': 'G', 'projet': 'apprendre à piloter une Formule 1'}, {'prenom': 'Justine', 'jour': '10', 'mois': '2', 'annee': '2004', 'sexe': 'F', 'projet': 'devenir présidente'}, {'prenom': 'Jules', 'jour': '28', 'mois': '6', 'annee': '2004', 'sexe': 'G', 'projet': 'créer un jeu vidéo'}, {'prenom': 'Baptiste', 'jour': '12', 'mois': '10', 'annee': '2004', 'sexe': 'G', 'projet': 'gérer sa propre entreprise'}, {'prenom': 'Thibault', 'jour': '23', 'mois': '10', 'annee': '2004', 'sexe': 'G', 'projet': 'gagner le Tour de France'}, {'prenom': 'Hugo', 'jour': '28', 'mois': '4', 'annee': '2004', 'sexe': 'G', 'projet': 'jouer dans le prochain James Bond'}, {'prenom': 'Amaury', 'jour': '12', 'mois': '7', 'annee': '2004', 'sexe': 'G', 'projet': 'devenir champion du monde de bras de fer'}, {'prenom': 'Esteban', 'jour': '7', 'mois': '5', 'annee': '2004', 'sexe': 'G', 'projet': 'devenir youtuber'}, {'prenom': 'Abdel-Waheb', 'jour': '13', 'mois': '10', 'annee': '2004', 'sexe': 'G', 'projet': 'avoir son émission de TV'}, {'prenom': 'Wesley', 'jour': '7', 'mois': '4', 'annee': '2004', 'sexe': 'G', 'projet': 'écrire un livre'}, {'prenom': 'Lubin', 'jour': '4', 'mois': '12', 'annee': '2004', 'sexe': 'G', 'projet': 'inventer la machine à voyager dans le temps'}, {'prenom': 'Teddy', 'jour': '1', 'mois': '12', 'annee': '2004', 'sexe': 'G', 'projet': 'devenir une rockstar'}]

Par défaut, toutes les valeurs sont mémorisées comme des chaînes de caractères, y compris le jour, le mois et l'année. On peut effectuer un prétraitement pour convertir en type `int` chaque valeur associée aux clés `'jour'`, `'mois'` et `'annee'` :

In [2]:
eleves = [
    {'prenom': e['prenom'],
     'jour': int(e['jour']),
     'mois': int(e['mois']),
     'annee': int(e['annee']),
     'sexe': e['sexe'],
     'projet': e['projet']} for e in eleves
]
print(eleves)

[{'prenom': 'Fathi', 'jour': 3, 'mois': 2, 'annee': 2003, 'sexe': 'G', 'projet': 'être heureux'}, {'prenom': 'Evan', 'jour': 19, 'mois': 8, 'annee': 2004, 'sexe': 'G', 'projet': 'manger une glace'}, {'prenom': 'Aline', 'jour': 29, 'mois': 10, 'annee': 2004, 'sexe': 'F', 'projet': 'gagner au loto'}, {'prenom': 'Baptiste', 'jour': 6, 'mois': 12, 'annee': 2002, 'sexe': 'G', 'projet': 'devenir quelqu’un de célèbre'}, {'prenom': 'Corentin', 'jour': 8, 'mois': 4, 'annee': 2004, 'sexe': 'G', 'projet': 'avoir une bonne note au prochain devoir'}, {'prenom': 'Estelle', 'jour': 29, 'mois': 3, 'annee': 2004, 'sexe': 'F', 'projet': 'devenir astronaute'}, {'prenom': 'Elisa', 'jour': 7, 'mois': 1, 'annee': 2004, 'sexe': 'F', 'projet': 'marcher sur la lune'}, {'prenom': 'Yanis', 'jour': 17, 'mois': 11, 'annee': 2004, 'sexe': 'G', 'projet': 'dormir plus longtemps le matin'}, {'prenom': 'Leonie', 'jour': 28, 'mois': 10, 'annee': 2004, 'sexe': 'F', 'projet': 'aider les autres'}, {'prenom': 'Lilian', 'jour': 26, 'mois': 10, 'annee': 2004, 'sexe': 'G', 'projet': 'apprendre à piloter une Formule 1'}, {'prenom': 'Justine', 'jour': 10, 'mois': 2, 'annee': 2004, 'sexe': 'F', 'projet': 'devenir présidente'}, {'prenom': 'Jules', 'jour': 28, 'mois': 6, 'annee': 2004, 'sexe': 'G', 'projet': 'créer un jeu vidéo'}, {'prenom': 'Baptiste', 'jour': 12, 'mois': 10, 'annee': 2004, 'sexe': 'G', 'projet': 'gérer sa propre entreprise'}, {'prenom': 'Thibault', 'jour': 23, 'mois': 10, 'annee': 2004, 'sexe': 'G', 'projet': 'gagner le Tour de France'}, {'prenom': 'Hugo', 'jour': 28, 'mois': 4, 'annee': 2004, 'sexe': 'G', 'projet': 'jouer dans le prochain James Bond'}, {'prenom': 'Amaury', 'jour': 12, 'mois': 7, 'annee': 2004, 'sexe': 'G', 'projet': 'devenir champion du monde de bras de fer'}, {'prenom': 'Esteban', 'jour': 7, 'mois': 5, 'annee': 2004, 'sexe': 'G', 'projet': 'devenir youtuber'}, {'prenom': 'Abdel-Waheb', 'jour': 13, 'mois': 10, 'annee': 2004, 'sexe': 'G', 'projet': 'avoir son émission de TV'}, {'prenom': 'Wesley', 'jour': 7, 'mois': 4, 'annee': 2004, 'sexe': 'G', 'projet': 'écrire un livre'}, {'prenom': 'Lubin', 'jour': 4, 'mois': 12, 'annee': 2004, 'sexe': 'G', 'projet': 'inventer la machine à voyager dans le temps'}, {'prenom': 'Teddy', 'jour': 1, 'mois': 12, 'annee': 2004, 'sexe': 'G', 'projet': 'devenir une rockstar'}]

On a créé une base de données `eleves.db` qui ne contient que la *relation* `Eleve` suivante :

<pre style="padding-bottom:10px;">
    <code><em>Eleve</em>(<span style="padding-bottom:3px; border-bottom: 1px solid black;"><em>id_eleve</em></span> INT, <em>prenom</em> TEXT, <em>jour</em> INT, <em>mois</em> INT, <em>annee</em> INT, <em>sexe</em> TEXT, <em>projet</em> TEXT)</code>
</pre>

> On a ajouté un attribut `id_eleve`, pourquoi ?

**Remarque** : Le fichier `eleves.db` que nous utiliserons est accessible dans l'archive de ce chapitre.

# Utilisation d'un SGBD

Seul un logiciel de type SGBD (Système de Gestion de Bases de Données) peut manipuler les données présentes dans une base de données. 

Vous pouvez utiliser :

* **DB Browser for SQLite** qui est installé sur vos ordinateurs :
    * (ce logiciel est téléchargeable à l'adresse : [https://sqlitebrowser.org/](https://sqlitebrowser.org/))
    * Lancez le logiciel
    * Ouvrez le fichier `eleves.db` en le sélectionnant après avoir cliqué sur "Ouvrir une base de données"

* **sqliteonline** accessible en ligne à l'adresse [https://sqliteonline.com/](https://sqliteonline.com/).
    * Rendez-vous à l'adresse [https://sqliteonline.com/](https://sqliteonline.com/)
    * Cliquez sur _File_ puis sur _Open DB_ et sélectionnez le fichier `eleves.db`

# Première requête SQL

Commençons par une requête permettant d’afficher tout le contenu de la table `Eleve`.

```sql
SELECT * FROM Eleve;
```

**Analyse** :

* En SQL, chaque requête contient au moins les clauses `SELECT` et `FROM` et **se termine par un point-virgule**.
* Le mot-clé `SELECT` demande au SGBD d’afficher ce que contient une table.
* Après `SELECT`, il faut indiquer quels champs de la table, le SGBD doit récupérer dans celle-ci. Ici le caractère « `*` » indique qu’il faut récupérer **tous** les champs de la table.
* Après le `FROM` (de l’anglais « de ») on indique la table dans laquelle on veut récupérer des informations (ici `Eleve`)
* Bilan : cette requête se traduit par « prend tout ce qu’il y a dans la table `Eleve`, sous-entendu prend tous les champs de cette table.

**Q1** : Écrivez cette requête dans le SGBD puis exécutez-la. Vous devriez voir apparaître la table `Eleve` complète comme ci-dessous.

<table>
    <tbody><tr>
        <th>id_eleve</th>
        <th>prenom</th>
        <th>jour</th>
        <th>mois</th>
        <th>annee</th>
        <th>sexe</th>
        <th>projet</th>
    </tr>
    <tr>
        <td>1</td>
        <td>Fathi</td>
        <td>3</td>
        <td>2</td>
        <td>2003</td>
        <td>G</td>
        <td>être heureux</td>
    </tr>
    <tr>
        <td>2</td>
        <td>Evan</td>
        <td>19</td>
        <td>8</td>
        <td>2004</td>
        <td>G</td>
        <td>manger une glace</td>
    </tr>
    <tr>
        <td>3</td>
        <td>Aline</td>
        <td>29</td>
        <td>10</td>
        <td>2004</td>
        <td>F</td>
        <td>gagner au loto</td>
    </tr>
    <tr>
        <td>4</td>
        <td>Baptiste</td>
        <td>6</td>
        <td>12</td>
        <td>2002</td>
        <td>G</td>
        <td>devenir quelqu’un de célèbre</td>
    </tr>
    <tr>
        <td>5</td>
        <td>Corentin</td>
        <td>8</td>
        <td>4</td>
        <td>2004</td>
        <td>G</td>
        <td>avoir une bonne note au prochain devoir</td>
    </tr>
    <tr>
        <td>6</td>
        <td>Estelle</td>
        <td>29</td>
        <td>3</td>
        <td>2004</td>
        <td>F</td>
        <td>devenir astronaute</td>
    </tr>
    <tr>
        <td>7</td>
        <td>Elisa</td>
        <td>7</td>
        <td>1</td>
        <td>2004</td>
        <td>F</td>
        <td>marcher sur la lune</td>
    </tr>
    <tr>
        <td>8</td>
        <td>Yanis</td>
        <td>17</td>
        <td>11</td>
        <td>2004</td>
        <td>G</td>
        <td>dormir plus longtemps le matin</td>
    </tr>
    <tr>
        <td>9</td>
        <td>Leonie</td>
        <td>28</td>
        <td>10</td>
        <td>2004</td>
        <td>F</td>
        <td>aider les autres</td>
    </tr>
    <tr>
        <td>10</td>
        <td>Lilian</td>
        <td>26</td>
        <td>10</td>
        <td>2004</td>
        <td>G</td>
        <td>apprendre à piloter une Formule 1</td>
    </tr>
    <tr>
        <td>11</td>
        <td>Justine</td>
        <td>10</td>
        <td>2</td>
        <td>2004</td>
        <td>F</td>
        <td>devenir présidente</td>
    </tr>
    <tr>
        <td>12</td>
        <td>Jules</td>
        <td>28</td>
        <td>6</td>
        <td>2004</td>
        <td>G</td>
        <td>créer un jeu vidéo</td>
    </tr>
    <tr>
        <td>13</td>
        <td>Baptiste</td>
        <td>12</td>
        <td>10</td>
        <td>2004</td>
        <td>G</td>
        <td>gérer sa propre entreprise</td>
    </tr>
    <tr>
        <td>14</td>
        <td>Thibault</td>
        <td>23</td>
        <td>10</td>
        <td>2004</td>
        <td>G</td>
        <td>gagner le Tour de France</td>
    </tr>
    <tr>
        <td>15</td>
        <td>Hugo</td>
        <td>28</td>
        <td>4</td>
        <td>2004</td>
        <td>G</td>
        <td>jouer dans le prochain James Bond</td>
    </tr>
    <tr>
        <td>16</td>
        <td>Amaury</td>
        <td>12</td>
        <td>7</td>
        <td>2004</td>
        <td>G</td>
        <td>devenir champion du monde de bras de fer</td>
    </tr>
    <tr>
        <td>17</td>
        <td>Esteban</td>
        <td>7</td>
        <td>5</td>
        <td>2004</td>
        <td>G</td>
        <td>devenir youtuber</td>
    </tr>
    <tr>
        <td>18</td>
        <td>Abdel-Waheb</td>
        <td>13</td>
        <td>10</td>
        <td>2004</td>
        <td>G</td>
        <td>avoir son émission de TV</td>
    </tr>
    <tr>
        <td>19</td>
        <td>Wesley</td>
        <td>7</td>
        <td>4</td>
        <td>2004</td>
        <td>G</td>
        <td>écrire un livre</td>
    </tr>
    <tr>
        <td>20</td>
        <td>Lubin</td>
        <td>4</td>
        <td>12</td>
        <td>2004</td>
        <td>G</td>
        <td>inventer la machine à voyager dans le temps</td>
    </tr>
    <tr>
        <td>21</td>
        <td>Teddy</td>
        <td>1</td>
        <td>12</td>
        <td>2004</td>
        <td>G</td>
        <td>devenir une rockstar</td>
    </tr>
</tbody></table>

# Sélection de colonnes en SQL

**Rappel** : en classe de Première, on a effectué des projections sur les colonnes de la table. L’instruction suivante permet de créer une table `t` contenant les attributs `prenom` et `annee` de la table `eleves`. On dit que l'on fait ainsi une projection sur ces deux colonnes.

In [3]:
t = [{'prenom': e['prenom'], 'annee': e['annee']} for e in eleves]
t

[{'prenom': 'Fathi', 'annee': 2003},
 {'prenom': 'Evan', 'annee': 2004},
 {'prenom': 'Aline', 'annee': 2004},
 {'prenom': 'Baptiste', 'annee': 2002},
 {'prenom': 'Corentin', 'annee': 2004},
 {'prenom': 'Estelle', 'annee': 2004},
 {'prenom': 'Elisa', 'annee': 2004},
 {'prenom': 'Yanis', 'annee': 2004},
 {'prenom': 'Leonie', 'annee': 2004},
 {'prenom': 'Lilian', 'annee': 2004},
 {'prenom': 'Justine', 'annee': 2004},
 {'prenom': 'Jules', 'annee': 2004},
 {'prenom': 'Baptiste', 'annee': 2004},
 {'prenom': 'Thibault', 'annee': 2004},
 {'prenom': 'Hugo', 'annee': 2004},
 {'prenom': 'Amaury', 'annee': 2004},
 {'prenom': 'Esteban', 'annee': 2004},
 {'prenom': 'Abdel-Waheb', 'annee': 2004},
 {'prenom': 'Wesley', 'annee': 2004},
 {'prenom': 'Lubin', 'annee': 2004},
 {'prenom': 'Teddy', 'annee': 2004}]

En SQL, il est possible de sélectionner certaines colonnes de la table simplement en indiquant après le `SELECT`, les noms des attributs à conserver.

Par exemple, la requête

```sql
SELECT prenom, annee FROM Eleve;
```

permet de ne sélectionner que les attributs `prenom` et `annee` de la table `Eleve` (on fait une projection sur ces deux attributs). Elle produit le résultat :

<table>
    <tbody><tr>
        <th>prenom</th>
        <th>annee</th>
    </tr>
    <tr>
        <td>Fathi</td>
        <td>2003</td>
    </tr>
    <tr>
        <td>Evan</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Aline</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Baptiste</td>
        <td>2002</td>
    </tr>
    <tr>
        <td>Corentin</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Estelle</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Elisa</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Yanis</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Leonie</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Lilian</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Justine</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Jules</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Baptiste</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Thibault</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Hugo</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Amaury</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Esteban</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Abdel-Waheb</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Wesley</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Lubin</td>
        <td>2004</td>
    </tr>
    <tr>
        <td>Teddy</td>
        <td>2004</td>
    </tr>
</tbody></table>

**Q2** : Écrivez et testez une requête SQL permettant de sélectionner uniquement les attributs `prenom`, `sexe` et `projet`.

*Réponse* :

```sql


```

# Sélectionner de lignes en SQL

**Rappel** : en classe de Première, on a sélectionné des lignes de la table vérifiant une certaine condition. L’instruction suivante permettait de créer une table `eleves_nes_fevrier` contenant les lignes des élèves nés en février.

In [4]:
eleves_nes_fevrier = [e for e in eleves if e['mois'] == 2]
eleves_nes_fevrier

[{'prenom': 'Fathi',
  'jour': 3,
  'mois': 2,
  'annee': 2003,
  'sexe': 'G',
  'projet': 'être heureux'},
 {'prenom': 'Justine',
  'jour': 10,
  'mois': 2,
  'annee': 2004,
  'sexe': 'F',
  'projet': 'devenir présidente'}]

En SQL, il est possible de préciser la condition de sélection en l’écrivant juste après le mot clé `WHERE` comme ci-dessous.

```sql
SELECT * FROM Eleve WHERE mois = 2;
```

<table>
    <tbody><tr>
        <th>id_eleve</th>
        <th>prenom</th>
        <th>jour</th>
        <th>mois</th>
        <th>annee</th>
        <th>sexe</th>
        <th>projet</th>
    </tr>
    <tr>
        <td>1</td>
        <td>Fathi</td>
        <td>3</td>
        <td>2</td>
        <td>2003</td>
        <td>G</td>
        <td>être heureux</td>
    </tr>
    <tr>
        <td>11</td>
        <td>Justine</td>
        <td>10</td>
        <td>2</td>
        <td>2004</td>
        <td>F</td>
        <td>devenir présidente</td>
    </tr>
</tbody></table>

**Q3** : Écrivez et testez une requête SQL permettant d’afficher les élèves nés en 2004.

*Réponse* :

```sql


```

**Q4** : Écrivez et testez une requête SQL permettant d’afficher les filles nées en octobre 2004.

> On peut utiliser les opérateurs `AND` ou `OR` pour combiner les conditions de sélection.

*Réponse* :

```sql



```

# Sélectionner des lignes et des colonnes

**Rappel** : L’instruction suivante permettait de créer une table `prenoms_projets_des_filles` contenant les prénoms et les projets des filles de la classe.

In [5]:
prenoms_projets_des_filles = [{'prenom': e['prenom'], 'projet': e['projet']} for e in eleves if e['sexe'] == 'F']
prenoms_projets_des_filles

[{'prenom': 'Aline', 'projet': 'gagner au loto'},
 {'prenom': 'Estelle', 'projet': 'devenir astronaute'},
 {'prenom': 'Elisa', 'projet': 'marcher sur la lune'},
 {'prenom': 'Leonie', 'projet': 'aider les autres'},
 {'prenom': 'Justine', 'projet': 'devenir présidente'}]

En SQL, pour combiner les les sélections sur les lignes et les projections sur les colonnes, il suffit de préciser les attributs de projection après le `SELECT` et préciser la condition de sélection après le `WHERE`.

Par exemple, la requête

```sql
SELECT prenom, projet FROM Eleve WHERE sexe="F";
```

permet d'afficher une table contenant les prénoms et les projets des filles de la classe :

<table>
    <tbody><tr>
        <th>prenom</th>
        <th>projet</th>
    </tr>
    <tr>
        <td>Aline</td>
        <td>gagner au loto</td>
    </tr>
    <tr>
        <td>Estelle</td>
        <td>devenir astronaute</td>
    </tr>
    <tr>
        <td>Elisa</td>
        <td>marcher sur la lune</td>
    </tr>
    <tr>
        <td>Leonie</td>
        <td>aider les autres</td>
    </tr>
    <tr>
        <td>Justine</td>
        <td>devenir présidente</td>
    </tr>
</tbody></table>

**Q5** : Écrivez et testez une requête SQL permettant d’afficher les prénoms des élèves nés en avril 2004.

*Réponse* :

```sql



```

**Q6**: Écrivez et testez une requête SQL permettant d’afficher les id, prénoms et projets des élèves nés les six derniers mois de l’année 2004.

*Réponse* :

```sql



```

# Trier les résultats avec ORDER BY

La commande `ORDER BY` permet de trier les résultats d’une requête en précisant juste après sur quel attribut le tri doit se faire.

Par exemple, la requête

```sql
SELECT prenom, annee FROM Eleves ORDER BY prenom ASC;
```

permet de trier le résultat de la requête `SELECT prenom, annee FROM Eleves` selon les prénoms des élèves, ici selon l’ordre alphabétique grâce à `ASC` (« ascendant », du plus petit au plus grand). 

>Il suffirait de remplacer `ASC` par `DESC` (« descendant ») pour que le tri se fasse dans le sens inverse.

**Q7** Écrivez et testez une requête SQL permettant d’afficher les prénoms et l’année de naissance des élèves, le résultat étant trié par ordre croissant d’année de naissance.

*Réponse* :

```sql


```

**Q8** : Écrivez et testez une requête SQL permettant d’afficher, du plus jeune au moins jeune, les prénoms des élèves nés en octobre 2004.

> On peut combiner les clauses `WHERE` et `ORDER BY`

*Réponse* :

```sql



```

# Quelques fonctions de calculs

Il est possible d'utiliser des fonctions de calculs en SQL. En voici quelques unes.

## Compter le nombre de tuples : `COUNT(*)`

Donnons tout de suite deux exemples.

La requête SQL suivante permet de compter le nombre d’élèves de la classe.

```sql
SELECT COUNT(*) AS nbEleves FROM Eleve;
```

<table>
    <tbody><tr>
        <th>nbEleves</th>
    </tr>
    <tr>
        <td>21</td>
    </tr>
</tbody></table>

La requête SQL suivante permet de compter le nombre de garçons de la classe.

```sql
SELECT COUNT(*) AS nbGarcons FROM Eleve WHERE sexe = "G";
```

<table>
    <tbody><tr>
        <th>nbGarcons</th>
    </tr>
    <tr>
        <td>16</td>
    </tr>
</tbody></table>

**Analyse de la deuxième requête** :

* On sélectionne les tuples de la table `Eleve` correspondant à des garçons grâce à l’instruction `FROM Eleves WHERE sexe="G"`
* L’instruction `COUNT(*)` permet de compter *tous* les tuples sélectionnés 
* L’ajout de `AS nbGarcons` permet de nommer le résultat. Cette astuce est optionnelle mais est particulièrement utile pour faciliter la lecture des requêtes.

**Q9** : Écrivez une requête SQL permettant de compter le nombre d’élèves nés en 2004.

*Réponse* :

```sql



```

**Q10** : Écrivez une requête SQL permettant de compter le nombre d’élèves nés en février.

*Réponse* :

```sql



```

## Compter le nombre de valeurs distinctes d'un attribut

La requête 

```sql
SELECT annee FROM Eleve;
```

va afficher les années de naissance de chacun des 16 élèves (à savoir 2003, 2003, 2003, …, 2002, 2004, 2003)

L’utilisation d’un `DISTINCT` permet d’éviter les redondances dans les résultats affichées. Ainsi, l’instruction

```sql
SELECT DISTINCT annee FROM Eleve;
```

ne va afficher que les années de naissance distinctes des élèves (à savoir 2003, 2002, 2004). N’hésitez pas à tester ces deux requêtes.

Pour compter le nombre d’années de naissance distinctes des élèves de la classe, il suffit d’ajouter un `COUNT` comme suit :

```sql
SELECT COUNT(DISTINCT annee) AS nbAnneesDistinctes FROM Eleve;
```

**Q11** : Écrivez une requête SQL permettant de compter le nombre de mois de naissances différents des élèves de la classe.

*Réponse* :

```sql



```

## La fonction `AVG()`

La fonction d'agrégation `AVG()` (de l'anglais, _average_ signifiant "moyenne") dans le langage SQL permet de calcule une valeur moyenne d'un ensemble de valeurs numériques.

Par exemple, la requête

```sql
SELECT AVG(annee) AS anneeMoyenne FROM Eleve;
```

permet de calculer l’année moyenne de naissance des élèves de la classe.

<table>
    <tbody><tr>
        <th>anneeMoyenne</th>
    </tr>
    <tr>
        <td>2003.857142857143</td>
    </tr>
</tbody></table>

**Q12** : Écrivez une requête SQL permettant de calculer l’âge moyen des élèves de la classe (en 2021). Ce résultat sera nommé `ageMoyen`.

*Réponse* :

```sql



```

# Bilan

* Pour interroger une base de données, on doit écrire des requêtes dans le langage SQL via un logiciel de type SGBD.
* Nous avions ici une base de données formée d'une seule table, ce qui n'est pas souvent le cas. Ainsi, vous découvrirez d'autres fonctionnalités du langage SQL dans la suite de ce chapitre où nous travaillerons aussi sur des bases de données formées de plusieurs tables.

---
Germain BECKER, Sébastien Point, Lycée Mounier, ANGERS

Ressource éducative libre distribuée sous [Licence Creative Commons Attribution - Pas d’Utilisation Commerciale - Partage dans les Mêmes Conditions 4.0 International](http://creativecommons.org/licenses/by-nc-sa/4.0/) 

![Licence Creative Commons](https://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png)